# Datos faltantes
pg 119

In [2]:
import pandas as pd
import numpy as np

Pueden ser `null` `NaN` `None`  
Hay varios algoritmos para tratarlos, `masking approach` o `sentinel approach`. No hay un método universal optimo.  
En Pandas se usa sentinel approach. 
Se marcan como `NaN`, que es un float. O con `None` de Python.

### None

Arrays con el tipo de datos `object`. Significa qu ees el mejor tipo de datos que NumPy puede inferir. Las operaciones se realizaran al nivel de Python.  
Si haces agregaciones o suma... con `None` obtendremos un error.

### NaN

Es un float nativo de NumPy. Mucho más rápido que las operaciones a nivel Python. El resultado de operar un `NaN` es otro. No da error. Se pueden usar lo métodos que evitan NaN. `np.nansum()`

### Operando Nulos

NaN y None son tratados por Pandas igual.
- isnull()
- notnull()
- dropna()
- fillna()

### Detectar nulos

In [3]:
data = pd.Series([1, np.nan, 'hello', None])

In [4]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [5]:
data[data.notnull()]

0        1
2    hello
dtype: object

### Quitando valores nulos

In [6]:
data.dropna()

0        1
2    hello
dtype: object

In [7]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

No se pueden quitar valores únicos, solo filas o columnas (axis=1)

In [8]:
df.dropna()

     0    1  2
1  2.0  3.0  5

Se puede especificar `how` o un `thresh`

In [9]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [10]:
df.dropna(axis='rows', thresh=3)

     0    1  2
1  2.0  3.0  5

### Rellenando valores nulos

In [11]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [12]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [13]:
# forward-fill
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [14]:
df.fillna(method='ffill', axis=1)

     0    1    2
0  1.0  1.0  2.0
1  2.0  3.0  5.0
2  NaN  4.0  6.0